<template>
  <div class="article-wrapper">
    <div class="article-item1">
      我的第一篇文章在我曾写简历的时候，朋友说翻墙是一件上不了台面的事儿，到现在有些时候，尤其是挤在402公交车上时都在想台面到底算是个什么东西，比如说相亲的时候媒婆总旁敲侧击的提醒你，交通工具不能说是自行车，学历更不能提初中，不然上不了台面，我就很好奇如果两个人在一起，是要关灯睡在一个屋子里的，所以我还是觉得有些问题开诚布公的讲还是比较好，比如我的银行存款仍然是个位数。言归正传,翻墙是一件由浅入深的技术活，期间或许考验阁下
    </div>
    <div class="article-item1">
      我的第一篇文章在我曾写简历的时候，朋友说翻墙是一件上不了台面的事儿，到现在有些时候，尤其是挤在402公交车上时都在想台面到底算是个什么东西，比如说相亲的时候媒婆总旁敲侧击的提醒你，交通工具不能说是自行车，学历更不能提初中，不然上不了台面，我就很好奇如果两个人在一起，是要关灯睡在一个屋子里的，所以我还是觉得有些问题开诚布公的讲还是比较好，比如我的银行存款仍然是个位数。言归正传,翻墙是一件由浅入深的技术活，期间或许考验阁下
    </div>
    <div class="article-item1">
      我的第一篇文章在我曾写简历的时候，朋友说翻墙是一件上不了台面的事儿，到现在有些时候，尤其是挤在402公交车上时都在想台面到底算是个什么东西，比如说相亲的时候媒婆总旁敲侧击的提醒你，交通工具不能说是自行车，学历更不能提初中，不然上不了台面，我就很好奇如果两个人在一起，是要关灯睡在一个屋子里的，所以我还是觉得有些问题开诚布公的讲还是比较好，比如我的银行存款仍然是个位数。言归正传,翻墙是一件由浅入深的技术活，期间或许考验阁下
    </div>
    <div class="article-item1">
      我的第一篇文章在我曾写简历的时候，朋友说翻墙是一件上不了台面的事儿，到现在有些时候，尤其是挤在402公交车上时都在想台面到底算是个什么东西，比如说相亲的时候媒婆总旁敲侧击的提醒你，交通工具不能说是自行车，学历更不能提初中，不然上不了台面，我就很好奇如果两个人在一起，是要关灯睡在一个屋子里的，所以我还是觉得有些问题开诚布公的讲还是比较好，比如我的银行存款仍然是个位数。言归正传,翻墙是一件由浅入深的技术活，期间或许考验阁下
    </div>
  </div>

</template>

<script>
  export default {}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
  .article-wrapper {
    width: 77%;
    float: right;
    margin-right: 80px;
  }
  .article-item1 {
    padding: 20px 0 0 15px;
    height: 100px;
    /*background: antiquewhite;*/
    overflow: hidden;
    text-overflow: ellipsis;
    border-bottom: 1px solid #d2e8db;
    color: #555;
    font-size: 13px;
    letter-spacing: 2px;
    text-indent: 30px;
  }


</style>
